uhnp/src/InformationRegisters/УдалитьОтветственныеЗаСверкуВГОПоОрганизациям/УдалитьОтветственныеЗаСверкуВГОПоОрганизациям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УдалитьОтветственныеЗаСверкуВГОПоОрганизациям</name>
  <resources>
    <name>Куратор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодСценария</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.Сценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ОтветственныеОрганизаций/ОтветственныеОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеОрганизаций</name>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочийКаталог</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьПоEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНапоминания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКомпактныйИнтерфейс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезСистемуВзаимодействия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОповещатьЧерезТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправочникАнкетыПоставщиков</name>
      <description>Контактная информация &quot;Анкета поставщиков&quot;</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонСДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВсегда</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Constants/РольИсполнительВГО/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура НачальноеЗаполнение() Экспорт

	ИмяКонстанты = "РольИсполнительВГО";
	НаименованиеРоли = НСтр("ru = 'Исполнитель сверки ВГО'", ОбщегоНазначения.КодОсновногоЯзыка());
	СформироватьКонстанту(ИмяКонстанты, НаименованиеРоли);
	
	ИмяКонстанты = "РольКураторВГО";
	НаименованиеРоли = НСтр("ru = 'Куратор сверки ВГО'", ОбщегоНазначения.КодОсновногоЯзыка());
	СформироватьКонстанту(ИмяКонстанты, НаименованиеРоли);

КонецПроцедуры

Процедура СформироватьКонстанту(ИмяКонстанты, НаименованиеРоли)
	
	Если Не Константы[ИмяКонстанты].Получить().Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаРоль = Справочники.РолиКонтактныхЛиц.НайтиПоНаименованию(НаименованиеРоли);
	Если Не ЗначениеЗаполнено(СсылкаРоль) Тогда
		
		ОбъектРоль = Справочники.РолиКонтактныхЛиц.СоздатьЭлемент();
		ОбъектРоль.Наименование = НаименованиеРоли;
		ОбъектРоль.УстановитьНовыйКод();
		//ОбъектРоль.ПроверятьУникальность = Истина;
		ОбновлениеИнформационнойБазы.ЗаписатьОбъект(ОбъектРоль);
		СсылкаРоль = ОбъектРоль.Ссылка;
		
	КонецЕсли;
	
	Константы[ИмяКонстанты].Установить(СсылкаРоль);		
	
КонецПроцедуры

Процедура ПереходНаКонстанты() Экспорт

	Если Метаданные.РегистрыСведений.Найти("УдалитьОтветственныеЗаСверкуВГОПоОрганизациям") = Неопределено Тогда
		Возврат;//удален рс	
	КонецЕсли;

	НачальноеЗаполнение();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(т.ПериодСценария) КАК ПериодСценария,
	|	МАКСИМУМ(т.Сценарий) КАК Сценарий
	|ПОМЕСТИТЬ АктуальнаяНастройка
	|ИЗ
	|	РегистрСведений.УдалитьОтветственныеЗаСверкуВГОПоОрганизациям КАК т
	|ГДЕ
	|	т.ПериодСценария В
	|			(ВЫБРАТЬ
	|				МАКСИМУМ(п.ПериодСценария) КАК ПериодСценария
	|			ИЗ
	|				РегистрСведений.УдалитьОтветственныеЗаСверкуВГОПоОрганизациям КАК п)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ПериодСценария,
	|	Сценарий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	т.Организация КАК Организация,
	|	т.Куратор КАК Куратор,
	|	т.Исполнитель КАК Исполнитель
	|ИЗ
	|	РегистрСведений.УдалитьОтветственныеЗаСверкуВГОПоОрганизациям КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ АктуальнаяНастройка КАК АктуальнаяНастройка
	|		ПО т.ПериодСценария = АктуальнаяНастройка.ПериодСценария
	|			И т.Сценарий = АктуальнаяНастройка.Сценарий");
	
	РольИспольнитель = Константы.РольИсполнительВГО.Получить();
	РольКуратор = Константы.РольКураторВГО.Получить();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.Исполнитель.Пустая() Тогда
			РегистрыСведений.ОтветственныеОрганизаций.ЗаписатьОтветственного(
				Выборка.Организация, РольИспольнитель, Выборка.Исполнитель);
		КонецЕсли;
		
		Если Не Выборка.Куратор.Пустая() Тогда
			РегистрыСведений.ОтветственныеОрганизаций.ЗаписатьОтветственного(
				Выборка.Организация, РольКуратор, Выборка.Куратор);
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

Функция АдресаОтветственныхОрганизаций() Экспорт

	Запрос = Новый Запрос(ТекстЗапроса_АдресаОтветственныхВГО());
	Результат = Запрос.Выполнить().Выгрузить();
	
	Результат.Свернуть("Организация,АдресЭП");
	Результат.Индексы.Добавить("Организация");

	Возврат Результат;

КонецФункции

Функция ТекстЗапроса_АдресаОтветственныхВГО() Экспорт

	Возврат
	"ВЫБРАТЬ
	|	РольИсполнительВГО.Значение КАК Роль,
	|	ЛОЖЬ КАК Куратор
	|ПОМЕСТИТЬ втРоли
	|ИЗ
	|	Константа.РольИсполнительВГО КАК РольИсполнительВГО
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РольКураторВГО.Значение,
	|	ИСТИНА
	|ИЗ
	|	Константа.РольКураторВГО КАК РольКураторВГО
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Роль
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОтветственныеОрганизаций.Организация КАК Организация,
	|	втРоли.Куратор КАК Куратор,
	|	ОтветственныеОрганизаций.Пользователь КАК Пользователь,
	|	КИ.АдресЭП КАК АдресЭП
	|ИЗ
	|	РегистрСведений.ОтветственныеОрганизаций КАК ОтветственныеОрганизаций
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втРоли КАК втРоли
	|		ПО ОтветственныеОрганизаций.Роль = втРоли.Роль
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи.КонтактнаяИнформация КАК КИ
	|		ПО ОтветственныеОрганизаций.Пользователь = КИ.Ссылка
	|			И (КИ.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EmailПользователя))
	|			И (КИ.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.АдресЭлектроннойПочты))
	|ГДЕ
	|	КИ.АдресЭП <> """"";

КонецФункции

#КонецЕсли
